{"_id":{"$oid":"62443cbc0e74f19b525e069c"},"title":"The Shawshank Redemption","description":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","director":{"name":"Frank Darabont","bio":"Three-time Oscar nominee Frank Darabont was born in a refugee camp in 1959 in Montbeliard, France, the son of Hungarian parents who had fled Budapest during the failed 1956 Hungarian revolution.","birth":"January 28, 1959"},"genre":{"name":"Drama","description":"The drama genre features stories with high stakes and a lot of conflicts."},"featured":true}
{"_id":{"$oid":"62445f1f0e74f19b525e069d"},"title":"Lord of the Rings Trilogy","description":"A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.","director":{"name":"Peter Jackson","bio":"Peter Jackson started his prolific career as a child, creating short films with a 8-mm movie camera. Without any formal training, Jackson has directed a number of successful films ranging across all genres. ","birth":"October 31, 1961"},"genre":{"name":"Adventure","description":"Films in the adventure genre usually contain the same basic genre elements of an action movie with the setting as the key difference."}}
{"_id":{"$oid":"624460300e74f19b525e069e"},"title":"The Dark Knight","description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice. A oscar winning performace by Heath Ledger playing The Joker.","director":{"name":"Christopher Nolan","bio":"Christopher Nolan is a British film director and writer acclaimed for his noirish visual aesthetic and unconventional, often highly conceptual narratives.","birth":"July 30, 1970"},"genre":{"name":"Crime Drama","description":"Crime drama is a sub-genre of drama that focuses on crimes, the criminals that commit them and the police that catch them."}}
{"_id":{"$oid":"624460660e74f19b525e06a0"},"title":"The Godfather","description":"The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.","director":{"name":"Francis Ford Coppola","bio":"Coppola was born in Detroit, Michigan. Stricken with polio as a child, he was bedridden and found creative ways to entertain himself, including producing his own puppet shows. Coppola developed an interest in film early on and studied theater at Hofstra University in New York.","birth":"April 7, 1939"},"genre":{"name":"Crime Drama","description":"Crime drama is a sub-genre of drama that focuses on crimes, the criminals that commit them and the police that catch them."}}
{"_id":{"$oid":"624460860e74f19b525e06a1"},"title":"The Pianist","description":"A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.","director":{"name":"Roman Polanski","bio":"Raimund Polanski was born in Paris, France. At the age of three, he moved with his family to his father's native city of Krakow, Poland. In 1941, his parents were imprisoned in various Nazi concentration camps, leading to his mother's death in Auschwitz.","birth":"August 18, 1933"},"genre":{"name":"Biography","description":"The drama genre features stories with high stakes and a lot of conflicts."}}
{"_id":{"$oid":"6244609e0e74f19b525e06a2"},"title":"se7en","description":"Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.","director":{"name":"David Fincher","bio":"David Fincher was born in Denver, Colorado, and was raised in Marin County, California. When he was 18 years old he went to work for John Korty at Korty Films in Mill Valley. He subsequently worked at ILM (Industrial Light and Magic) from 1981-1983.","birth":"August 28, 1962"},"genre":{"name":"Crime Drama","description":"Crime drama is a sub-genre of drama that focuses on crimes, the criminals that commit them and the police that catch them."}}
{"_id":{"$oid":"624460b50e74f19b525e06a3"},"title":"12 Angry Men","description":"The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.","director":{"name":"Sidney Lumet","bio":"Sidney Lumet, American director who was noted for his psychological dramas, which typically featured characters wrestling with moral or emotional conflicts involving betrayal, corruption, or disillusionment.","birth":"June 25, 1924"},"genre":{"name":"Crime Drama","description":"Crime drama is a sub-genre of drama that focuses on crimes, the criminals that commit them and the police that catch them."}}
{"_id":{"$oid":"624460ce0e74f19b525e06a4"},"title":"Saving Ptivate Ryan","description":"Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.","director":{"name":"Steven Spielberg","bio":"Steven Spielberg was an amateur filmmaker as a child. He went on to become the enormously successful and Academy Award-winning director of such films as Schindler's List, The Color Purple, E.T.: The Extra-Terrestrial, Saving Private Ryan, Catch Me If You Can, Lincoln and Bridge of Spies. In 1994, he co-founded the studio Dreamworks SKG, which was purchased by Paramount Pictures in 2005.","birth":"December 18, 1946"},"genre":{"name":"War","description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."}}
{"_id":{"$oid":"624460ed0e74f19b525e06a5"},"title":"Interstellar","description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","director":{"name":"Christopher Nolan","bio":"Christopher Nolan is a British film director and writer acclaimed for his noirish visual aesthetic and unconventional, often highly conceptual narratives.","birth":"July 30, 1970"},"genre":{"name":"Sci-Fi Adventure","description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, spacecraft, robots, cyborgs, interstellar travel or other technologies."}}
{"_id":{"$oid":"624462c10e74f19b525e06a6"},"title":"Schindler's List","description":"In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","director":{"name":"Steven Spielberg","bio":"Steven Spielberg is a dude who makes movies. YAY!","birth":"December 18, 1946"},"genre":{"name":"Biography","description":"A Biography drama incorporates dramatic elements into a biographical film. These films differ from Historical and “based in truth” films because they specifically chronicle the life of a person or a group of people."}}
